Revit 2027 API
LinePatternSegmentType Enumeration
 Represents the type of a line pattern segment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum LinePatternSegmentType
Public Enumeration LinePatternSegmentType
public enum class LinePatternSegmentType
type LinePatternSegmentType
Members
Member name | Value | Description
Dash | 0 |  A dash
Dot | 2 |  A dot
Invalid | 3
Space | 1 |  A space
See Also
Reference
Autodesk.Revit.DB Namespace